99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_twt/esp32_mquickjs_wifi_twt_tx.c
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (fresh != NULL) esp32_mquickjs_memory_payload_free(fresh);
    if (error == ESP_OK) esp32_mquickjs_wifi_twt_information_bind_native(&native, entry->setup_identity);
    return error;
}
int __wrap_ht_action_output(void *node, void *buffer)
{
    uint32_t callbacks = twt_tx_callbacks(buffer);
    uint32_t teardown_identity = 0;
    twt_tx_entry_t *entry = (callbacks & TWT_TX_CALLBACK_MASK) ? twt_tx_begin(buffer) : NULL;
    if (callbacks & (1U << 20)) {
        esp_err_t error = twt_tx_information_capture(node, buffer, entry);
        if (error != ESP_OK) {
            bool duplicate = false;
            portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
            if (entry == NULL && s_twt_tx.entries != NULL)
                for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i)
                    if (s_twt_tx.entries[i].buffer == buffer &&
                        !(s_twt_tx.entries[i].flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED))) duplicate = true;
            portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
            if (!duplicate) __wrap_esf_buf_recycle(buffer);
            twt_tx_output_returned(entry);
            return error;
        }
    }
    if (callbacks & (1U << 18)) {
        esp_err_t error = esp32_mquickjs_wifi_twt_teardown_tx_output_native(node, buffer, entry != NULL, &teardown_identity);
        if (error != ESP_OK) {
            bool duplicate = false;
            portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
            if (entry == NULL && s_twt_tx.entries != NULL)
                for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i)
                    if (s_twt_tx.entries[i].buffer == buffer &&
                        !(s_twt_tx.entries[i].flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED))) duplicate = true;
            portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
            if (!duplicate) __wrap_esf_buf_recycle(buffer);
            twt_tx_output_returned(entry);
            return error;
        }
        if (teardown_identity != 0U && entry != NULL) {
            portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
            entry->setup_identity = teardown_identity;
            entry->probe_status = TWT_TX_MANAGED_TEARDOWN;
            portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
        }
    }
    bool setup = (callbacks & (1U << 19)) != 0U;
    if (setup) {
        uint8_t dialog, flow;
        uint32_t identity = 0;
        bool broadcast = ((const uint8_t *)buffer)[61] != 0U;
        esp_err_t capture_error = broadcast ? twt_tx_broadcast_capture(node, buffer, entry) : ESP_OK;
        bool valid = broadcast ? capture_error == ESP_OK :
            entry != NULL && twt_tx_setup_fields(buffer, false, &dialog, &flow) &&
            esp32_mquickjs_wifi_twt_setup_tx_capture_native((uintptr_t)node, dialog, flow, &identity);
        portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
        if (valid && !broadcast) entry->setup_identity = identity;
        else if (!valid && !(broadcast && capture_error == ESP_ERR_NO_MEM) &&
            s_twt_tx.snapshot.fault == ESP32_MQUICKJS_WIFI_TWT_TX_OK)
            s_twt_tx.snapshot.fault = broadcast ? ESP32_MQUICKJS_WIFI_TWT_TX_BROADCAST_IDENTITY : ESP32_MQUICKJS_WIFI_TWT_TX_SETUP_IDENTITY;
        bool duplicate = false;
        if (entry == NULL && s_twt_tx.entries != NULL) {
            for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i)
                if (s_twt_tx.entries[i].buffer == buffer &&
                    !(s_twt_tx.entries[i].flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED))) duplicate = true;
        }
        esp_err_t error = s_twt_tx.snapshot.fault == ESP32_MQUICKJS_WIFI_TWT_TX_NO_MEMORY ||
            s_twt_tx.snapshot.fault == ESP32_MQUICKJS_WIFI_TWT_TX_CAPACITY ? ESP_ERR_NO_MEM : broadcast ? capture_error : ESP_ERR_INVALID_STATE;
        twt_tx_changed();
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
        if (!valid) {
            /* The reviewed builder propagates output errors. It has already
             * installed pending/timer state; caller still owes retirement.
             * Return the allocated EB without emitting an unidentified TX. */
            if (!duplicate) __wrap_esf_buf_recycle(buffer);
            twt_tx_output_returned(entry);
            return error;
        }
    }
    /* Other TWT frames remain observational on tracking failure. Preserve
     * native output/PMF behavior and the sticky incomplete-retirement fault. */
    uint32_t broadcast_identity = 0;
    unsigned broadcast_slot = 32;
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (entry != NULL && entry->probe_status == TWT_TX_BROADCAST_SETUP) {
        broadcast_identity = entry->setup_identity;
        broadcast_slot = s_twt_tx.information->entries[entry - s_twt_tx.entries].broadcast.parameter[10] >> 3;
    }
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    int result = __real_ht_action_output(node, buffer);
    if (broadcast_identity != 0)
        esp32_mquickjs_wifi_btwt_setup_submitted_native(broadcast_slot, broadcast_identity, result);
    if (teardown_identity != 0U) esp32_mquickjs_wifi_twt_teardown_tx_output_returned(buffer, teardown_identity);
    twt_tx_output_returned(entry);
    return result;
}
void __wrap_he_twt_setup_txcb(void *buffer)
{
    if (buffer == NULL) return;
    if (xPortInIsrContext()) return;
    twt_broadcast_identity_t broadcast = {0};
    bool is_broadcast = false;
    twt_tx_entry_t *entry = NULL;
    uint32_t identity = 0;
    TaskHandle_t task = xTaskGetCurrentTaskHandle();
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (s_twt_tx.entries != NULL) {
        for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
            twt_tx_entry_t *candidate = &s_twt_tx.entries[i];
            if (candidate->buffer == buffer && candidate->setup_identity != 0U &&
                (candidate->probe_status == 0U || (candidate->probe_status == TWT_TX_BROADCAST_SETUP &&
                    s_twt_tx.information != NULL && s_twt_tx.information_task == task)) &&
                !(candidate->flags & TWT_TX_PROBE) &&
                !(candidate->flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED | TWT_TX_CALLBACK_SEEN))) {
                entry = candidate; identity = entry->setup_identity;
                is_broadcast = entry->probe_status == TWT_TX_BROADCAST_SETUP;
                if (is_broadcast) broadcast = s_twt_tx.information->entries[i].broadcast;
                entry->flags |= TWT_TX_CALLBACK_SEEN | TWT_TX_CALLBACK_BUSY;
                twt_tx_changed(); break;
            }
        }
    }
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (entry == NULL) return;
    uint8_t dialog, flow;
    if (is_broadcast) {
        twt_broadcast_identity_t current;
        if (((const uint8_t *)buffer)[61] != 0U && twt_tx_broadcast_fields(buffer, true, &current) &&
            current.dialog == broadcast.dialog && !memcmp(current.parameter, broadcast.parameter, sizeof(current.parameter)) &&
            esp32_mquickjs_wifi_twt_sdk_broadcast_node_matches_native(broadcast.node) &&
            esp32_mquickjs_wifi_btwt_timer_available_native(broadcast.parameter[10] >> 3) == ESP_OK) {
            const uint8_t *metadata;
            memcpy(&metadata, (const uint8_t *)buffer + 56, sizeof(metadata));
            esp32_mquickjs_wifi_btwt_setup_tx_complete_native(broadcast.parameter[10] >> 3, identity,
                broadcast.node, broadcast.dialog, broadcast.parameter, metadata[19]);
        }
    } else if (((const uint8_t *)buffer)[61] == 0U && twt_tx_setup_fields(buffer, true, &dialog, &flow) &&
        esp32_mquickjs_wifi_twt_setup_tx_matches_native(identity, dialog, flow))
        __real_he_twt_setup_txcb(buffer);
    /* The real callback may synchronously cause recycling. Only retained
     * ledger storage is accessed after return; never read that EB again. */
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    entry->flags &= ~TWT_TX_CALLBACK_BUSY;
    twt_tx_finished(entry);
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
}
void __wrap_he_twt_information_txcb(void *buffer)
{
    if (buffer == NULL || xPortInIsrContext()) return;
    TaskHandle_t task = xTaskGetCurrentTaskHandle();
    twt_tx_entry_t *entry = NULL;
    esp32_mquickjs_wifi_twt_information_identity_t native = {0};
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (s_twt_tx.entries != NULL && s_twt_tx.information != NULL && s_twt_tx.information_task == task)
        for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
            twt_tx_entry_t *candidate = &s_twt_tx.entries[i];
            if (candidate->buffer == buffer && candidate->setup_identity != 0U &&
                (candidate->probe_status & TWT_TX_INFORMATION) &&
                !(candidate->flags & (TWT_TX_PROBE | TWT_TX_RECYCLING | TWT_TX_RECYCLED | TWT_TX_CALLBACK_SEEN))) {
                entry = candidate; native = s_twt_tx.information->entries[i].information;
                entry->flags |= TWT_TX_CALLBACK_SEEN | TWT_TX_CALLBACK_BUSY;
                entry->probe_status &= (uint8_t)~TWT_TX_INFORMATION_WAKE;
                twt_tx_changed(); break;
            }
        }
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (entry == NULL) return;
    uint8_t control;
    bool valid = twt_tx_information_control(buffer, true, &control) && control == native.control &&
        esp32_mquickjs_wifi_twt_sdk_information_matches_native(control & 7U, &native);
    uint32_t tx_identity = entry->setup_identity; /* Slot pinned by CALLBACK_BUSY. */
    bool managed = esp32_mquickjs_wifi_twt_information_callback_begin(tx_identity);
    if (valid) __real_he_twt_information_txcb(buffer); /* First call repays PM. */
    else pm_twt_wake_done(); /* Reject mutation, repay only this TX's reference. */
    if (managed) esp32_mquickjs_wifi_twt_information_callback_end(tx_identity, valid);
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    entry->flags &= (uint8_t)~TWT_TX_CALLBACK_BUSY;
    twt_tx_finished(entry);
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
}
esp_err_t esp32_mquickjs_wifi_twt_tx_information_quiescent_native(uint32_t identity)
{
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    esp_err_t error = s_twt_tx.snapshot.fault == ESP32_MQUICKJS_WIFI_TWT_TX_OK ? ESP_OK : ESP_ERR_INVALID_STATE;
    if (s_twt_tx.entries != NULL)
        for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
            const twt_tx_entry_t *entry = &s_twt_tx.entries[i];
            if (entry->buffer != NULL && (!identity || entry->setup_identity == identity) &&
                !(entry->flags & TWT_TX_PROBE) && (entry->probe_status & TWT_TX_INFORMATION)) error = ESP_ERR_NOT_FINISHED;
        }
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    return error;
}
void esp32_mquickjs_wifi_twt_tx_cleanup_native(void)
{
    if (xPortInIsrContext()) return;
    TaskHandle_t task = xTaskGetCurrentTaskHandle();
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    bool native = s_twt_tx.information_task == task;
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (!native) return;
    for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
        portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
        twt_tx_entry_t *entry = s_twt_tx.entries != NULL ? &s_twt_tx.entries[i] : NULL;
        bool repay = entry != NULL && entry->buffer != NULL &&
            !(entry->flags & (TWT_TX_PROBE | TWT_TX_RECYCLING | TWT_TX_CALLBACK_BUSY)) &&
            (entry->flags & (TWT_TX_OUTPUT_RETURNED | TWT_TX_RECYCLED)) == (TWT_TX_OUTPUT_RETURNED | TWT_TX_RECYCLED) &&
            (entry->probe_status & (TWT_TX_INFORMATION | TWT_TX_INFORMATION_WAKE)) ==
                (TWT_TX_INFORMATION | TWT_TX_INFORMATION_WAKE);
        if (repay) {
            entry->probe_status &= (uint8_t)~TWT_TX_INFORMATION_WAKE;
            entry->flags |= TWT_TX_CALLBACK_BUSY;
            twt_tx_changed();
        }
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
        if (!repay) continue;
        pm_twt_wake_done();
        portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
        entry->flags &= (uint8_t)~TWT_TX_CALLBACK_BUSY;
        twt_tx_finished(entry);
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    }
}
static bool twt_tx_probe(void *buffer)
{
    if (buffer == NULL || xPortInIsrContext()) return false;
    TaskHandle_t task = xTaskGetCurrentTaskHandle();
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    bool scoped = s_twt_tx.probe_task != NULL && s_twt_tx.probe_task == task;
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (!scoped) return false;
    /* The reviewed TWT probe handler calls send_probereq with callback index
     * zero. That index is shared with ordinary connection probes, so neither
     * callback identity nor a global 'probe pending' flag identifies this TX.
     * Require this native call's task AND its actual Probe Request header. */
    const uint8_t *metadata, *descriptor, *frame;
    uint32_t callbacks;
    uint16_t header_length;
    memcpy(&metadata, (const uint8_t *)buffer + 56, sizeof(metadata));
    memcpy(&descriptor, (const uint8_t *)buffer + 4, sizeof(descriptor));
    memcpy(&header_length, (const uint8_t *)buffer + 20, sizeof(header_length));
    if (metadata == NULL || descriptor == NULL || header_length < 24U) return false;
    memcpy(&callbacks, metadata + 20, sizeof(callbacks));
    if (callbacks != 1U) return false;
    memcpy(&frame, descriptor + 4, sizeof(frame));
    return frame != NULL && (frame[0] & 0xfcU) == 0x40U;
}
int __wrap_ic_tx_pkt(void *buffer)
{
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    esp32_mquickjs_wifi_nan_tx_submitting(buffer);
#endif
    /* ic_tx_pkt itself is flash-resident in the reviewed C5 image. Only the
     * common recycler below needs an IRAM-only call/data closure. */
    if (!twt_tx_probe(buffer)) return __real_ic_tx_pkt(buffer);
    twt_tx_entry_t *entry = twt_tx_begin(buffer);
    /* A TWT probe must not be transmitted without callback identity. The
     * native handler's nonzero send-result path posts failure and releases
     * its PM wake reference. Return its already allocated EB before failing. */
    if (entry == NULL) {
        __wrap_esf_buf_recycle(buffer);
        return ESP_ERR_NO_MEM;
    }
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    bool claimed = s_twt_tx.probe_entry == NULL;
    if (claimed) {
        s_twt_tx.probe_entry = entry;
        entry->flags |= TWT_TX_PROBE | TWT_TX_PROBE_SUBMIT;
    } else if (s_twt_tx.snapshot.fault == ESP32_MQUICKJS_WIFI_TWT_TX_OK)
        s_twt_tx.snapshot.fault = ESP32_MQUICKJS_WIFI_TWT_TX_PROBE_SCOPE;
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (!claimed) {
        __wrap_esf_buf_recycle(buffer);
        twt_tx_output_returned(entry);
        return ESP_ERR_INVALID_STATE;
    }
    int result = __real_ic_tx_pkt(buffer);
    twt_tx_output_returned(entry);
    return result;
}
int __wrap_wifi_sta_itwt_send_probe_req_process(void *message)
{
    int admission = esp32_mquickjs_wifi_twt_sdk_probe_admit_native();
    if (admission != ESP_OK) return admission;
    TaskHandle_t task = xTaskGetCurrentTaskHandle();
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (task == NULL || s_twt_tx.probe_task != NULL || s_twt_tx.probe_entry != NULL ||
        s_twt_tx.snapshot.fault != ESP32_MQUICKJS_WIFI_TWT_TX_OK) {
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
        return ESP_ERR_INVALID_STATE;
    }
    s_twt_tx.probe_task = task;
    s_twt_tx.snapshot.probe_calls = 1;
    twt_tx_changed();
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    uint32_t identity = 0;
    int result = esp32_mquickjs_wifi_twt_probe_result_begin_native(&identity);
    if (result == ESP_OK) {
        result = __real_wifi_sta_itwt_send_probe_req_process(message);
        esp_err_t timer_error = esp32_mquickjs_wifi_twt_probe_timer_finish_native();
        if (result == ESP_OK) result = timer_error;
    }
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    s_twt_tx.snapshot.probe_calls = 0;
    s_twt_tx.probe_task = NULL;
    twt_tx_entry_t *entry = s_twt_tx.probe_entry;
    bool deferred = entry != NULL && (entry->flags & TWT_TX_CALLBACK_DEFERRED) && result == ESP_OK;
    int status = entry != NULL ? entry->probe_status : 0;
    if (entry != NULL) {
        entry->flags &= ~(TWT_TX_PROBE_SUBMIT | TWT_TX_CALLBACK_DEFERRED);
        if (deferred) entry->flags |= TWT_TX_CALLBACK_BUSY;
        twt_tx_finished(entry);
    }
    twt_tx_changed();
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (deferred) {
        (void)__real_itwt_probe_rc_tx_cb(status);
        esp_err_t timer_error = esp32_mquickjs_wifi_twt_probe_timer_finish_native();
        if (result == ESP_OK) result = timer_error;
        portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
        entry->flags &= ~TWT_TX_CALLBACK_BUSY;
        twt_tx_finished(entry);
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    }
    esp32_mquickjs_wifi_twt_probe_result_submitted_native(identity, result);
    return result;
}
/* The build-local C5 call site passes EB instead of its status byte. It is the
 * only undefined reference to this SDK symbol. Ordinary connection callbacks
 * return -1 to retain cnx traversal; recognized TWT callbacks return 0 even on
 * failure, so their error cannot advance an unrelated connection candidate. */
int __wrap_itwt_probe_rc_tx_cb(void *buffer)
{
    twt_tx_entry_t *entry = NULL;
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (buffer != NULL && s_twt_tx.entries != NULL) {
        for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
            twt_tx_entry_t *candidate = &s_twt_tx.entries[i];
            if (candidate->buffer == buffer && (candidate->flags & TWT_TX_PROBE) &&
                !(candidate->flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED))) {
                entry = candidate;
                break;
            }
        }
    }
    if (entry == NULL) {
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
        return -1;
    }
    if (entry != s_twt_tx.probe_entry || (entry->flags & TWT_TX_CALLBACK_SEEN)) {
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
        return 0;
    }
    const uint8_t *metadata;
    memcpy(&metadata, (const uint8_t *)buffer + 56, sizeof(metadata));
    entry->probe_status = metadata[19];
    entry->flags |= TWT_TX_CALLBACK_SEEN;
    bool deferred = (entry->flags & TWT_TX_PROBE_SUBMIT) != 0U;
    entry->flags |= deferred ? TWT_TX_CALLBACK_DEFERRED : TWT_TX_CALLBACK_BUSY;
    int status = entry->probe_status;
    twt_tx_changed();
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (!deferred) {
        (void)__real_itwt_probe_rc_tx_cb(status);
        (void)esp32_mquickjs_wifi_twt_probe_timer_finish_native();
        portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
        entry->flags &= ~TWT_TX_CALLBACK_BUSY;
        twt_tx_finished(entry);
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    }
    return 0;
}
void IRAM_ATTR __wrap_esf_buf_recycle(void *buffer)
{
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    uint32_t nan_ticket = esp32_mquickjs_wifi_nan_tx_recycling(buffer);
#endif
#if (CONFIG_ESP_WIFI_DPP_SUPPORT || CONFIG_ESP_WIFI_NAN_USD_ENABLE)
    uint64_t offchan_ticket = esp32qjs_wifi_offchan_frame_recycle(buffer);
#endif
    twt_tx_entry_t *entry = NULL;
    uint32_t teardown_identity = 0;
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (buffer != NULL && s_twt_tx.entries != NULL && s_twt_tx.snapshot.tracked != 0U) {
        for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
            twt_tx_entry_t *candidate = &s_twt_tx.entries[i];
            if (candidate->buffer == buffer && !(candidate->flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED))) {
                entry = candidate;
                if (!(entry->flags & TWT_TX_PROBE) && entry->probe_status == TWT_TX_MANAGED_TEARDOWN)
                    teardown_identity = entry->setup_identity;
                entry->flags |= TWT_TX_RECYCLING;
                ++s_twt_tx.snapshot.recycle_calls;
                twt_tx_changed();
                break;
            }
        }
    }
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    if (teardown_identity != 0U) esp32_mquickjs_wifi_twt_teardown_tx_recycle(buffer, teardown_identity, true);
    __real_esf_buf_recycle(buffer);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    esp32_mquickjs_wifi_nan_tx_recycled(nan_ticket);
#endif
#if (CONFIG_ESP_WIFI_DPP_SUPPORT || CONFIG_ESP_WIFI_NAN_USD_ENABLE)
    esp32qjs_wifi_offchan_frame_recycled(offchan_ticket);
#endif
    /* Never read the EB or metadata after the native recycler: either may
     * already be freed/reused. Only our separately retained slot is touched. */
    if (entry != NULL) {
        if (teardown_identity != 0U) esp32_mquickjs_wifi_twt_teardown_tx_recycle(buffer, teardown_identity, false);
        portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
        --s_twt_tx.snapshot.recycle_calls;
        entry->flags = (entry->flags & ~TWT_TX_RECYCLING) | TWT_TX_RECYCLED;
        twt_tx_finished(entry);
        portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    }
}
void esp32_mquickjs_wifi_twt_tx_snapshot(esp32_mquickjs_wifi_twt_tx_snapshot_t *output)
{
    if (output == NULL) return;
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    *output = s_twt_tx.snapshot;
    output->probe_buffer_present = s_twt_tx.probe_entry != NULL;
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
}
bool esp32_mquickjs_wifi_twt_tx_teardown_identity(void *buffer, uint32_t *identity)
{
    if (buffer == NULL || identity == NULL) return false;
    bool found = false;
    portENTER_CRITICAL_SAFE(&s_twt_tx_lock);
    if (s_twt_tx.entries != NULL)
        for (unsigned i = 0; i < TWT_TX_CAPACITY; ++i) {
            const twt_tx_entry_t *entry = &s_twt_tx.entries[i];
            if (entry->buffer != buffer || (entry->flags & (TWT_TX_RECYCLING | TWT_TX_RECYCLED))) continue;
            *identity = !(entry->flags & TWT_TX_PROBE) && entry->probe_status == TWT_TX_MANAGED_TEARDOWN
                ? entry->setup_identity : 0;
            found = true;
            break;
        }
    portEXIT_CRITICAL_SAFE(&s_twt_tx_lock);
    return found;
}
#endif
